{"modelTopology": null, "weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense_3/kernel", "shape": [100, 51200]}, {"dtype": "float32", "name": "dense_3/bias", "shape": [51200]}, {"dtype": "float32", "name": "conv2d_11/kernel", "shape": [3, 3, 128, 128]}, {"dtype": "float32", "name": "conv2d_11/bias", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_8/gamma", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_8/beta", "shape": [128]}, {"dtype": "float32", "name": "conv2d_12/kernel", "shape": [3, 3, 128, 64]}, {"dtype": "float32", "name": "conv2d_12/bias", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_9/gamma", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_9/beta", "shape": [64]}, {"dtype": "float32", "name": "conv2d_13/kernel", "shape": [3, 3, 64, 1]}, {"dtype": "float32", "name": "conv2d_13/bias", "shape": [1]}, {"dtype": "float32", "name": "batch_normalization_8/moving_mean", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_8/moving_variance", "shape": [128]}, {"dtype": "float32", "name": "batch_normalization_9/moving_mean", "shape": [64]}, {"dtype": "float32", "name": "batch_normalization_9/moving_variance", "shape": [64]}], "paths": ["group1-shard1of6", "group1-shard2of6", "group1-shard3of6", "group1-shard4of6", "group1-shard5of6", "group1-shard6of6"]}]}