{"modelTopology": {"training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": [], "optimizer_config": {"config": {"decay": 0.0, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}, "class_name": "Adam"}, "sample_weight_mode": null}, "keras_version": "2.1.6-tf", "model_config": {"config": [{"config": {"activity_regularizer": null, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "cu_dnnlstm", "units": 256, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "return_state": false, "return_sequences": true, "dtype": "float32", "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 11, 1], "stateful": false}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout", "dtype": "float32", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "recurrent_regularizer": null, "recurrent_constraint": null, "unit_forget_bias": true, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "name": "cu_dnnlstm_1", "units": 256, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "return_state": false, "return_sequences": false, "dtype": "float32", "recurrent_initializer": {"config": {"dtype": "float32", "seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "stateful": false}, "class_name": "LSTM"}, {"config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "dtype": "float32", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "units": 63, "use_bias": true, "trainable": true, "activation": "softmax", "name": "dense", "dtype": "float32", "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "dtype": "float32", "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential"}, "backend": "tensorflow"}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"dtype": "float32", "shape": [1, 1024], "name": "cu_dnnlstm/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "cu_dnnlstm/recurrent_kernel"}, {"dtype": "float32", "shape": [2048], "name": "cu_dnnlstm/bias"}, {"dtype": "float32", "shape": [256, 1024], "name": "cu_dnnlstm_1/kernel"}, {"dtype": "float32", "shape": [256, 1024], "name": "cu_dnnlstm_1/recurrent_kernel"}, {"dtype": "float32", "shape": [2048], "name": "cu_dnnlstm_1/bias"}, {"dtype": "float32", "shape": [256, 63], "name": "dense/kernel"}, {"dtype": "float32", "shape": [63], "name": "dense/bias"}]}]}