{"modelTopology": null, "weightsManifest": [{"weights": [{"name": "cu_dnnlstm/kernel", "shape": [1, 1024], "dtype": "float32"}, {"name": "cu_dnnlstm/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "cu_dnnlstm/bias", "shape": [2048], "dtype": "float32"}, {"name": "cu_dnnlstm_1/kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "cu_dnnlstm_1/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "cu_dnnlstm_1/bias", "shape": [2048], "dtype": "float32"}, {"name": "dense/kernel", "shape": [256, 63], "dtype": "float32"}, {"name": "dense/bias", "shape": [63], "dtype": "float32"}], "paths": ["group1-shard1of1"]}]}